In [1]:
import pandas as pd

#### JOIN

In [17]:
type(df2)

pandas.core.frame.DataFrame

In [7]:
df1 = pd.DataFrame({'id': [1,2,3,4,5], 'stat_marks': [99,97,93,92,98]})
df2 = pd.DataFrame({'sno': [3,4,5,6,7], 'ml_marks': [92,94,98,95,89]})
df2

   sno  ml_marks
0    3        92
1    4        94
2    5        98
3    6        95
4    7        89

In [8]:
df1

   id  stat_marks
0   1          99
1   2          97
2   3          93
3   4          92
4   5          98

In [9]:
# JOIN is a new concept and no connection with SQL
# JOIN is also used to combine two dataframes using INDEX

In [10]:
df1.join(df2)

   id  stat_marks  sno  ml_marks
0   1          99    3        92
1   2          97    4        94
2   3          93    5        98
3   4          92    6        95
4   5          98    7        89

In [ ]:
# Local machine ( jupyter notebook , pycharm , spyder, vscode )

#### Importing dataset in pandas ( excel , csv)

In [11]:
pwd # present working directory # (the folder where Pandas-2.ipynb --current notebook is available )
# windows: C:/users/trainer/ #path 
# You can navigate to this folder --> this pc --> C drive --> Users --> profile

'/Users/trainer/07-09-2025_10am'

In [12]:
df1 = pd.read_csv('Auto.csv')
df1.head()

FileNotFoundError: [Errno 2] No such file or directory: 'Auto.csv'

In [ ]:
# Basically python is looking auto.csv (file ) in above folder 07-09-2025_10am'
# if the file is kept in the same folder where code is also available then you can execute this line

In [14]:
pwd

'/Users/trainer/07-09-2025_10am'

In [13]:
df1 = pd.read_csv('Auto.csv')
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [15]:
# local machine -> it wont work in colab ( there is no connection between your laptop to colab)
# if your file is available in any other location
df1 = pd.read_csv(r'/Users/trainer/Downloads/Auto.csv') # r--> read/ raw string
df1.head() # top 5 observations / rows/records/data points

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino

In [ ]:
# your function name and extension using should match with each other
# excel file --> .xlsx --> read_excel
# .csv --> read_csv

In [16]:
type(df1) # data structure of df1 --> dataframe

pandas.core.frame.DataFrame

In [18]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [19]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino
5,NaN,8.0,NaN,198,4341,10.0,70,1,ford galaxie 500
6,NaN,8.0,NaN,220,4354,9.0,70,1,chevrolet impala
7,14.0,8.0,NaN,215,4312,8.5,70,1,plymouth fury iii
8,14.0,8.0,455.0,225,4425,10.0,70,1,pontiac catalina
9,15.0,8.0,390.0,190,3850,8.5,70,1,amc ambassador dpl

In [20]:
df1.tail() # bottom 5 records by default

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [21]:
df1.tail(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

In [22]:
df1.tail(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
387,26.0,4.0,156.0,92,2585,14.5,82,1,chrysler lebaron medallion
388,22.0,6.0,232.0,112,2835,14.7,82,1,ford granada l
389,32.0,4.0,144.0,96,2665,13.9,82,3,toyota celica gt
390,36.0,4.0,135.0,84,2370,13.0,82,1,dodge charger 2.2
391,27.0,4.0,151.0,90,2950,17.3,82,1,chevrolet camaro
392,27.0,4.0,140.0,86,2790,15.6,82,1,ford mustang gl
393,44.0,4.0,97.0,52,2130,24.6,82,2,vw pickup
394,32.0,4.0,135.0,84,2295,11.6,82,1,dodge rampage
395,28.0,4.0,120.0,79,2625,18.6,82,1,ford ranger
396,31.0,4.0,119.0,82,2720,19.4,82,1,chevy s-10

#### Analysing data

In [23]:
df1.shape # rows , columns

(397, 9)

In [24]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [25]:
df1.dtypes # we need to validate is it correct / wrong
# numbers: int/ float 
# strings: object

mpg             float64
cylinders       float64
displacement    float64
Horse Power      object
weight            int64
acceleration    float64
year              int64
origin            int64
name             object
dtype: object

In [26]:
import numpy as np
np.array([1,2,3,4,5,6,7,8,9,'a'])

array(['1', '2', '3', '4', '5', '6', '7', '8', '9', 'a'], dtype='<U21')

In [57]:
import numpy as np
np.array([1,2,3,4,5,6,7,8,9,])

array([1, 2, 3, 4, 5, 6, 7, 8, 9])

In [27]:
df1.isnull()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False
2,True,False,False,False,False,False,False,False,False
3,True,False,True,False,False,False,False,False,False
4,True,False,True,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...
392,False,False,False,False,False,False,False,False,False
393,False,False,False,False,False,False,False,False,False
394,False,False,False,False,False,False,False,False,False
395,False,False,False,False,False,False,False,False,False
396,False,False,False,False,False,False,False,False,False

In [28]:
df1.isnull().sum() # it will count how many times True appeared in each column

mpg             5
cylinders       3
displacement    5
Horse Power     0
weight          0
acceleration    0
year            0
origin          0
name            0
dtype: int64

In [29]:
df1.count() # it will return how many non null entries - excluding missing values how many rows are there

mpg             392
cylinders       394
displacement    392
Horse Power     397
weight          397
acceleration    397
year            397
origin          397
name            397
dtype: int64

In [30]:
df1.columns

Index(['mpg', 'cylinders', 'displacement', 'Horse Power', 'weight',
       'acceleration', 'year', 'origin', 'name'],
      dtype='object')

In [31]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 397 entries, 0 to 396
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mpg           392 non-null    float64
 1   cylinders     394 non-null    float64
 2   displacement  392 non-null    float64
 3   Horse Power   397 non-null    object
 4   weight        397 non-null    int64
 5   acceleration  397 non-null    float64
 6   year          397 non-null    int64
 7   origin        397 non-null    int64
 8   name          397 non-null    object
dtypes: float64(4), int64(3), object(2)
memory usage: 28.0+ KB

In [32]:
dir(pd)

['ArrowDtype',
 'BooleanDtype',
 'Categorical',
 'CategoricalDtype',
 'CategoricalIndex',
 'DataFrame',
 'DateOffset',
 'DatetimeIndex',
 'DatetimeTZDtype',
 'ExcelFile',
 'ExcelWriter',
 'Flags',
 'Float32Dtype',
 'Float64Dtype',
 'Grouper',
 'HDFStore',
 'Index',
 'IndexSlice',
 'Int16Dtype',
 'Int32Dtype',
 'Int64Dtype',
 'Int8Dtype',
 'Interval',
 'IntervalDtype',
 'IntervalIndex',
 'MultiIndex',
 'NA',
 'NaT',
 'NamedAgg',
 'Period',
 'PeriodDtype',
 'PeriodIndex',
 'RangeIndex',
 'Series',
 'SparseDtype',
 'StringDtype',
 'Timedelta',
 'TimedeltaIndex',
 'Timestamp',
 'UInt16Dtype',
 'UInt32Dtype',
 'UInt64Dtype',
 'UInt8Dtype',
 '__all__',
 '__builtins__',
 '__cached__',
 '__doc__',
 '__docformat__',
 '__file__',
 '__git_version__',
 '__loader__',
 '__name__',
 '__package__',
 '__path__',
 '__spec__',
 '__version__',
 '_built_with_meson',
 '_config',
 '_is_numpy_dev',
 '_libs',
 '_pandas_datetime_CAPI',
 '_pandas_parser_CAPI',
 '_testing',
 '_typing',
 '_version_meson',
 'annotations',
 'api',
 'array',
 'arrays',
 'bdate_range',
 'compat',
 'concat',
 'core',
 'crosstab',
 'cut',
 'date_range',
 'describe_option',
 'errors',
 'eval',
 'factorize',
 'from_dummies',
 'get_dummies',
 'get_option',
 'infer_freq',
 'interval_range',
 'io',
 'isna',
 'isnull',
 'json_normalize',
 'lreshape',
 'melt',
 'merge',
 'merge_asof',
 'merge_ordered',
 'notna',
 'notnull',
 'offsets',
 'option_context',
 'options',
 'pandas',
 'period_range',
 'pivot',
 'pivot_table',
 'plotting',
 'qcut',
 'read_clipboard',
 'read_csv',
 'read_excel',
 'read_feather',
 'read_fwf',
 'read_gbq',
 'read_hdf',
 'read_html',
 'read_json',
 'read_orc',
 'read_parquet',
 'read_pickle',
 'read_sas',
 'read_spss',
 'read_sql',
 'read_sql_query',
 'read_sql_table',
 'read_stata',
 'read_table',
 'read_xml',
 'reset_option',
 'set_eng_float_format',
 'set_option',
 'show_versions',
 'test',
 'testing',
 'timedelta_range',
 'to_datetime',
 'to_numeric',
 'to_pickle',
 'to_timedelta',
 'tseries',
 'unique',
 'util',
 'value_counts',
 'wide_to_long']

In [33]:
df1.describe() # stats analysis of each column # it only works for int / float

,mpg,cylinders,displacement,weight,acceleration,year,origin
count,392.000000,394.000000,392.000000,397.000000,397.000000,397.000000,397.000000
mean,23.611735,5.439086,191.080357,2970.261965,15.555668,75.994962,1.574307
std,7.827466,1.693452,102.452019,847.904119,2.749995,3.690005,0.802549
min,9.000000,3.000000,68.000000,1613.000000,8.000000,70.000000,1.000000
25%,17.500000,4.000000,100.750000,2223.000000,13.800000,73.000000,1.000000
50%,23.000000,4.000000,145.500000,2800.000000,15.500000,76.000000,1.000000
75%,29.000000,8.000000,260.000000,3609.000000,17.100000,79.000000,2.000000
max,46.600000,8.000000,455.000000,5140.000000,24.800000,82.000000,3.000000

In [34]:
df1['mpg']

0      18.0
1      15.0
2       NaN
3       NaN
4       NaN
       ...
392    27.0
393    44.0
394    32.0
395    28.0
396    31.0
Name: mpg, Length: 397, dtype: float64

In [35]:
df1[['mpg','acceleration','displacement']]

      mpg  acceleration  displacement
0    18.0          12.0         307.0
1    15.0          11.5         350.0
2     NaN          11.0         318.0
3     NaN          12.0           NaN
4     NaN          10.5           NaN
..    ...           ...           ...
392  27.0          15.6         140.0
393  44.0          24.6          97.0
394  32.0          11.6         135.0
395  28.0          18.6         120.0
396  31.0          19.4         119.0

[397 rows x 3 columns]

In [36]:
df1['mpg'].mean()

23.611734693877548

In [37]:
df1[['mpg','acceleration','displacement']].min()

mpg              9.0
acceleration     8.0
displacement    68.0
dtype: float64

In [38]:
df1.describe

<bound method NDFrame.describe of       mpg  cylinders  displacement Horse Power  weight  acceleration  year  \
0    18.0        8.0         307.0         130    3504          12.0    70
1    15.0        8.0         350.0         165    3693          11.5    70
2     NaN        8.0         318.0         150    3436          11.0    70
3     NaN        8.0           NaN         150    3433          12.0    70
4     NaN        8.0           NaN         140    3449          10.5    70
..    ...        ...           ...         ...     ...           ...   ...
392  27.0        4.0         140.0          86    2790          15.6    82
393  44.0        4.0          97.0          52    2130          24.6    82
394  32.0        4.0         135.0          84    2295          11.6    82
395  28.0        4.0         120.0          79    2625          18.6    82
396  31.0        4.0         119.0          82    2720          19.4    82

     origin                       name
0         1  chevrolet chevelle malibu
1         1          buick skylark 320
2         1         plymouth satellite
3         1              amc rebel sst
4         1                ford torino
..      ...                        ...
392       1            ford mustang gl
393       2                  vw pickup
394       1              dodge rampage
395       1                ford ranger
396       1                 chevy s-10

[397 rows x 9 columns]>

In [39]:
print(df1)

      mpg  cylinders  displacement Horse Power  weight  acceleration  year  \
0    18.0        8.0         307.0         130    3504          12.0    70
1    15.0        8.0         350.0         165    3693          11.5    70
2     NaN        8.0         318.0         150    3436          11.0    70
3     NaN        8.0           NaN         150    3433          12.0    70
4     NaN        8.0           NaN         140    3449          10.5    70
..    ...        ...           ...         ...     ...           ...   ...
392  27.0        4.0         140.0          86    2790          15.6    82
393  44.0        4.0          97.0          52    2130          24.6    82
394  32.0        4.0         135.0          84    2295          11.6    82
395  28.0        4.0         120.0          79    2625          18.6    82
396  31.0        4.0         119.0          82    2720          19.4    82

     origin                       name
0         1  chevrolet chevelle malibu
1         1          buick skylark 320
2         1         plymouth satellite
3         1              amc rebel sst
4         1                ford torino
..      ...                        ...
392       1            ford mustang gl
393       2                  vw pickup
394       1              dodge rampage
395       1                ford ranger
396       1                 chevy s-10

[397 rows x 9 columns]

In [40]:
df1[['mpg','acceleration','displacement']]

      mpg  acceleration  displacement
0    18.0          12.0         307.0
1    15.0          11.5         350.0
2     NaN          11.0         318.0
3     NaN          12.0           NaN
4     NaN          10.5           NaN
..    ...           ...           ...
392  27.0          15.6         140.0
393  44.0          24.6          97.0
394  32.0          11.6         135.0
395  28.0          18.6         120.0
396  31.0          19.4         119.0

[397 rows x 3 columns]

#### Feature Engineering

In [ ]:
# select quantity*price as Sales from df1

In [43]:
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320

In [45]:
df1['col1'] =  df1['weight'] + df1['origin'] # +, -, *, /, //, ** , %
df1.head(2) # im using head option to check changes are reflecting or not

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694

In [46]:
df1['col2'] = df1['acceleration'] **2
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,144.00
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,132.25
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3437,121.00
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3434,144.00
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3450,110.25

In [ ]:
# if new name was given --> new column will be created
# if old name was given --> values inside older column will be replaced

In [47]:
df1['col2'] = df1['acceleration'] ** 3
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,1520.875
2,NaN,8.0,318.0,150,3436,11.0,70,1,plymouth satellite,3437,1331.000
3,NaN,8.0,NaN,150,3433,12.0,70,1,amc rebel sst,3434,1728.000
4,NaN,8.0,NaN,140,3449,10.5,70,1,ford torino,3450,1157.625

#### Cleaning the dataset

In [48]:
# changing data type

In [49]:
# astype : int <-->float , str , any doable data type changes 
# to_numeric: forcefully changing them

In [51]:
df1['col3'] =  df1['acceleration'].astype(int)
df1.head(2)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.0,8.0,307.0,130,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.0,8.0,350.0,165,3693,11.5,70,1,buick skylark 320,3694,1520.875,11

In [52]:
df1['Horse Power'].astype(int)

ValueError: invalid literal for int() with base 10: '?'

In [53]:
int('?') # not possible

ValueError: invalid literal for int() with base 10: '?'

In [54]:
int('25') # possible to convert into int

25

In [55]:
df1['Horse Power'].isnull().sum()
# 0 indicate no missing values

0

In [56]:
pd.to_numeric(df1['Horse Power'])

ValueError: Unable to parse string "?" at position 32

In [60]:
df1['Horse Power'] = pd.to_numeric(df1['Horse Power'],errors = 'coerce')
# errors = 'coerce' # try to changing data type into int/float if its not possible remove that string

In [61]:
df1['Horse Power'].isnull().sum()

5

In [62]:
# how to handle missing values

In [ ]:
# dropna: to remove the row where null value is
# fillna: to replace that missing value with something else

In [63]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,NaN,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,NaN,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,NaN,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10
5,NaN,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,4342,1000.000,10
6,NaN,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,4355,729.000,9
7,14.0,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,4313,614.125,8
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4426,1000.000,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3851,614.125,8

In [64]:
df1.dropna() # change is not perminent

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.0,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.0,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
8,14.0,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4426,1000.000,10
9,15.0,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3851,614.125,8
10,15.0,8.0,383.0,170.0,3563,10.0,70,1,dodge challenger se,3564,1000.000,10
...,...,...,...,...,...,...,...,...,...,...,...,...
392,27.0,4.0,140.0,86.0,2790,15.6,82,1,ford mustang gl,2791,3796.416,15
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2132,14886.936,24
394,32.0,4.0,135.0,84.0,2295,11.6,82,1,dodge rampage,2296,1560.896,11
395,28.0,4.0,120.0,79.0,2625,18.6,82,1,ford ranger,2626,6434.856,18
396,31.0,4.0,119.0,82.0,2720,19.4,82,1,chevy s-10,2721,7301.384,19

In [65]:
383/397

0.964735516372796

In [ ]:
# df1 = df1.dropna() 
# or
# df1.dropna(inplace = True)

In [66]:
# to replace your missing values --> mean, median , mode --> these options are best
# replacing missing values with average(mean) --> one of the best option # stats property

In [67]:
df1['mpg'].mean()

23.611734693877548

In [69]:
df1['mpg']= df1['mpg'].fillna(23.611734693877548)
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10

In [70]:
df1.isnull().sum()

mpg             0
cylinders       3
displacement    5
Horse Power     5
weight          0
acceleration    0
year            0
origin          0
name            0
col1            0
col2            0
col3            0
dtype: int64

#### Data Manipulation

In [71]:
df1.head(10)

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10
5,23.611735,8.0,NaN,198.0,4341,10.0,70,1,ford galaxie 500,4342,1000.000,10
6,23.611735,8.0,NaN,220.0,4354,9.0,70,1,chevrolet impala,4355,729.000,9
7,14.000000,8.0,NaN,215.0,4312,8.5,70,1,plymouth fury iii,4313,614.125,8
8,14.000000,8.0,455.0,225.0,4425,10.0,70,1,pontiac catalina,4426,1000.000,10
9,15.000000,8.0,390.0,190.0,3850,8.5,70,1,amc ambassador dpl,3851,614.125,8

In [72]:
df1.iloc[1:9,2:6]

   displacement  Horse Power  weight  acceleration
1         350.0        165.0    3693          11.5
2         318.0        150.0    3436          11.0
3           NaN        150.0    3433          12.0
4           NaN        140.0    3449          10.5
5           NaN        198.0    4341          10.0
6           NaN        220.0    4354           9.0
7           NaN        215.0    4312           8.5
8         455.0        225.0    4425          10.0

In [73]:
# iloc
# uses index to locate
# end value is not included

In [74]:
# loc
# it uses names to extract the data
# end value is included

In [75]:
df1.loc[1:8, 'displacement': 'acceleration']

   displacement  Horse Power  weight  acceleration
1         350.0        165.0    3693          11.5
2         318.0        150.0    3436          11.0
3           NaN        150.0    3433          12.0
4           NaN        140.0    3449          10.5
5           NaN        198.0    4341          10.0
6           NaN        220.0    4354           9.0
7           NaN        215.0    4312           8.5
8         455.0        225.0    4425          10.0

In [76]:
# Applying a function to dataframe

In [77]:
# if i wanted to square each number in acceleration column

In [92]:
# df1['acceleration'] ** 2

In [91]:
# res = [i**2 for i in df1['acceleration']]
# df1['col4'] = res
# df1.head()

In [85]:
def sqr_num(num):
    return num**2

In [86]:
sqr_num(4)

16

In [90]:
# res = [sqr_num(i) for i in df1['acceleration']]
# df1['col4'] = res
# df1.head()

In [89]:
df1['col5'] = df1['acceleration'].apply(sqr_num)
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3,col4,col5
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12,144.00,144.00
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11,132.25,132.25
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11,121.00,121.00
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12,144.00,144.00
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10,110.25,110.25

In [94]:
df1['acceleration'] + 5

0      17.0
1      16.5
2      16.0
3      17.0
4      15.5
       ...
392    20.6
393    29.6
394    16.6
395    23.6
396    24.4
Name: acceleration, Length: 397, dtype: float64

In [95]:
def evn_odd(num): # use it multiple times 
    if num%2 == 0:
        return 'Even'
    else:
        return 'odd'

In [96]:
df1['col5'] = df1['acceleration'].apply(evn_odd)
df1.head()

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3,col4,col5
0,18.000000,8.0,307.0,130.0,3504,12.0,70,1,chevrolet chevelle malibu,3505,1728.000,12,144.00,Even
1,15.000000,8.0,350.0,165.0,3693,11.5,70,1,buick skylark 320,3694,1520.875,11,132.25,odd
2,23.611735,8.0,318.0,150.0,3436,11.0,70,1,plymouth satellite,3437,1331.000,11,121.00,odd
3,23.611735,8.0,NaN,150.0,3433,12.0,70,1,amc rebel sst,3434,1728.000,12,144.00,Even
4,23.611735,8.0,NaN,140.0,3449,10.5,70,1,ford torino,3450,1157.625,10,110.25,odd

In [97]:
# lambda
# anonymous function # 1 time exectuion
# simple logics
df1['acceleration'].apply(lambda num: num**2)

0      144.00
1      132.25
2      121.00
3      144.00
4      110.25
        ...
392    243.36
393    605.16
394    134.56
395    345.96
396    376.36
Name: acceleration, Length: 397, dtype: float64

In [99]:
df1['col5'] = df1['acceleration'].apply(lambda num: 'Even' if num%2 == 0 else 'Odd')
# lambda param: return statement

In [ ]:
# read_json, read_csv, read_excel, sql table --> data could be from anywhere 
# load the data into python using pandas

In [100]:
# take subset based on conditions

In [101]:
# i wanted to extract rows where mpg value > 40

In [103]:
cond1 = df1['mpg'] > 40 # output will be boolean for relational operators 
cond1

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393     True
394    False
395    False
396    False
Name: mpg, Length: 397, dtype: bool

In [104]:
df1[cond1] # this will extract records where result was True in cond1

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3,col4,col5
244,43.1,4.0,90.0,48.0,1985,21.5,78,2,volkswagen rabbit custom diesel,1987,9938.375,21,462.25,Odd
309,41.5,4.0,98.0,76.0,2144,14.7,80,2,vw rabbit,2146,3176.523,14,216.09,Odd
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19,368.64,Odd
325,44.3,4.0,90.0,48.0,2085,21.7,80,2,vw rabbit c (diesel),2087,10218.313,21,470.89,Odd
326,43.4,4.0,90.0,48.0,2335,23.7,80,2,vw dasher (diesel),2337,13312.053,23,561.69,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13,190.44,Odd
330,40.9,4.0,85.0,NaN,1835,17.3,80,2,renault lecar deluxe,1837,5177.717,17,299.29,Odd
393,44.0,4.0,97.0,52.0,2130,24.6,82,2,vw pickup,2132,14886.936,24,605.16,Odd

In [105]:
cond2 = (df1['mpg'] > 40) & (df1['origin'] == 3 ) # output will be boolean for relational operators 
cond2

0      False
1      False
2      False
3      False
4      False
       ...
392    False
393    False
394    False
395    False
396    False
Length: 397, dtype: bool

In [106]:
df1[cond2]

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3,col4,col5
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13,190.44,Odd

In [ ]:
# to compare individual values use 'and'
# to compare series / data frame use bitwise operators # & , | , ~

In [122]:
# cond2 = (df1['mpg'] > 40) and (df1['origin'] == 3 ) # output will be boolean for relational operators 
# cond2

In [110]:
df1[ (df1['mpg'] > 40) & (df1['origin'] == 3 ) ] # output will be boolean for relational operators

,mpg,cylinders,displacement,Horse Power,weight,acceleration,year,origin,name,col1,col2,col3,col4,col5
322,46.6,4.0,86.0,65.0,2110,17.9,80,3,mazda glc,2113,5735.339,17,320.41,Odd
324,40.8,4.0,85.0,65.0,2110,19.2,80,3,datsun 210,2113,7077.888,19,368.64,Odd
329,44.6,4.0,91.0,67.0,1850,13.8,80,3,honda civic 1500 gl,1853,2628.072,13,190.44,Odd

In [111]:
# groupby # question asked in chat

In [113]:
df1.groupby(['cylinders','origin'])['mpg'].mean().reset_index()

   cylinders  origin        mpg
0        3.0       3  20.550000
1        4.0       1  27.908451
2        4.0       2  28.411111
3        4.0       3  31.595652
4        5.0       2  27.366667
5        6.0       1  19.663514
6        6.0       2  20.100000
7        6.0       3  23.883333
8        8.0       1  15.362587

In [114]:
df1[ (df1['cylinders'] == 3) & (df1['origin'] == 3 ) ]['mpg'].mean()

20.55

In [ ]:
# to export the results of df1

In [117]:
# df1.to_excel('output.xlsx', index = False) # if index is not needed
df1.to_csv('output.csv', index = False) # if index is not needed

In [118]:
pwd

'/Users/trainer/07-09-2025_10am'

In [119]:
df1.to_json('output.json') # you can export the results into json

In [120]:
True and True

True

In [123]:
'python's great'

SyntaxError: unterminated string literal (detected at line 1) (2494813490.py, line 1)

In [124]:
'python\'s great' # \ is called escape character

"python's great"